# EA_DataAccGetReal

## Description
Returns real value from the object, associated to the accessory index.

```pascal
FUNCTION EA_DataAccGetReal(
				acc        : INTEGER;
				valueIndex : INTEGER) : REAL;
```

```python

def vs.EA_DataAccGetReal(acc, valueIndex):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER||
|valueIndex|INTEGER||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library